<a href="https://colab.research.google.com/github/jeevan0603/data690_jeevan/blob/main/assignment_04/In_class_practice_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Session 4 in class practice 02
- Jeevan Sai Sreella
- 9/23/21

In [1]:
import pandas as pd

In [15]:
df = pd.read_csv("/content/census_costs.txt", sep="\t")
df.head()

  Census Year Total Population Census Cost Average Cost Per Person
0        1790        3,929,214     $44,377              1.13 cents
1        1800        5,308,483     $66,109              1.24 cents
2        1810        7,239,881    $178,445              2.46 cents
3        1820        9,633,822    $208,526              2.16 cents
4        1830       12,866,020    $378,545              2.94 cents

In [16]:
df.columns

Index(['Census Year', 'Total Population', 'Census Cost',
       'Average Cost Per Person'],
      dtype='object')

In [17]:
df.tail()

   Census Year Total Population     Census Cost Average Cost Per Person
18        1970      203,302,031    $247,653,000                   $1.22
19        1980      226,542,199  $1,078,488,000                   $4.76
20        1990      248,718,301  $2,492,830,000                  $10.02
21        2000      281,421,906    $4.5 Billion                  $15.99
22       2010*      308,745,538     $13 Billion                  $42.11

In [21]:
df.sample(3)

   Census Year Total Population   Census Cost Average Cost Per Person
17        1960      179,323,175  $127,934,000             71.34 cents
12        1910       91,972,266   $15,968,000             17.07 cents
21        2000      281,421,906  $4.5 Billion                  $15.99

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              23 non-null     object
 1   Total Population         23 non-null     object
 2   Census Cost              23 non-null     object
 3   Average Cost Per Person  23 non-null     object
dtypes: object(4)
memory usage: 864.0+ bytes

In [23]:
df

   Census Year Total Population     Census Cost Average Cost Per Person
0         1790        3,929,214         $44,377              1.13 cents
1         1800        5,308,483         $66,109              1.24 cents
2         1810        7,239,881        $178,445              2.46 cents
3         1820        9,633,822        $208,526              2.16 cents
4         1830       12,866,020        $378,545              2.94 cents
5         1840       17,069,458        $833,371              4.88 cents
6         1850       23,191,876      $1,423,351              6.14 cents
7         1860       31,443,321      $1,969,377              6.26 cents
8         1870       38,558,371      $3,421,198              8.87 cents
9         1880       50,155,783      $5,790,678             11.54 cents
10        1890       62,979,766     $11,547,127             18.33 cents
11        1900       76,303,387     $11,854,000             15.54 cents
12        1910       91,972,266     $15,968,000             17.07 cents
13        1920      105,710,620     $25,117,000             23.76 cents
14        1930      122,775,046     $40,156,000             32.71 cents
15        1940      131,669,275     $67,527,000             51.29 cents
16        1950      151,325,798     $91,462,000             60.44 cents
17        1960      179,323,175    $127,934,000             71.34 cents
18        1970      203,302,031    $247,653,000                   $1.22
19        1980      226,542,199  $1,078,488,000                   $4.76
20        1990      248,718,301  $2,492,830,000                  $10.02
21        2000      281,421,906    $4.5 Billion                  $15.99
22       2010*      308,745,538     $13 Billion                  $42.11

In [24]:
df.describe()

       Census Year Total Population     Census Cost Average Cost Per Person
count           23               23              23                      23
unique          23               23              23                      23
top           1840      308,745,538  $1,078,488,000                  $42.11
freq             1                1               1                       1

In [28]:
x =179,323,175
type(x)

tuple

In [33]:
y="123,456,789"

z = y.replace(",", "")
print(z)
t = int(z)
type(int(z))

123456789

int

In [34]:
type(t)

int

In [41]:
df[["Total Population"]]

   Total Population
0         3,929,214
1         5,308,483
2         7,239,881
3         9,633,822
4        12,866,020
5        17,069,458
6        23,191,876
7        31,443,321
8        38,558,371
9        50,155,783
10       62,979,766
11       76,303,387
12       91,972,266
13      105,710,620
14      122,775,046
15      131,669,275
16      151,325,798
17      179,323,175
18      203,302,031
19      226,542,199
20      248,718,301
21      281,421,906
22      308,745,538

In [49]:
# diff b/w series and list
# df["Total Population"] returns a series which can be converted to list (has tolist())
# df[["Total Population"]] return a data frame which has no tolist() function 
pop_list = df["Total Population"].tolist()
pop_list

['3,929,214',
 '5,308,483',
 '7,239,881',
 '9,633,822',
 '12,866,020',
 '17,069,458',
 '23,191,876',
 '31,443,321',
 '38,558,371',
 '50,155,783',
 '62,979,766',
 '76,303,387',
 '91,972,266',
 '105,710,620',
 '122,775,046',
 '131,669,275',
 '151,325,798',
 '179,323,175',
 '203,302,031',
 '226,542,199',
 '248,718,301',
 '281,421,906',
 '308,745,538']

In [54]:
pop_list2 = [int(pop.replace(",","")) for pop in pop_list]
print(pop_list2)

[3929214, 5308483, 7239881, 9633822, 12866020, 17069458, 23191876, 31443321, 38558371, 50155783, 62979766, 76303387, 91972266, 105710620, 122775046, 131669275, 151325798, 179323175, 203302031, 226542199, 248718301, 281421906, 308745538]

list

In [55]:
# function to convert a str of numbers separated by commas into integer

def cleanse_pop(pop):
    return int(pop.replace(",",""))

In [56]:
cleanse_pop("123,456,789")

123456789

In [58]:
df["total pop"] = pop_list2
# df["total pop"= df["Total Population"].apply(cleanse_pop)

In [59]:
df

   Census Year Total Population  ... Average Cost Per Person  total pop
0         1790        3,929,214  ...              1.13 cents    3929214
1         1800        5,308,483  ...              1.24 cents    5308483
2         1810        7,239,881  ...              2.46 cents    7239881
3         1820        9,633,822  ...              2.16 cents    9633822
4         1830       12,866,020  ...              2.94 cents   12866020
5         1840       17,069,458  ...              4.88 cents   17069458
6         1850       23,191,876  ...              6.14 cents   23191876
7         1860       31,443,321  ...              6.26 cents   31443321
8         1870       38,558,371  ...              8.87 cents   38558371
9         1880       50,155,783  ...             11.54 cents   50155783
10        1890       62,979,766  ...             18.33 cents   62979766
11        1900       76,303,387  ...             15.54 cents   76303387
12        1910       91,972,266  ...             17.07 cents   91972266
13        1920      105,710,620  ...             23.76 cents  105710620
14        1930      122,775,046  ...             32.71 cents  122775046
15        1940      131,669,275  ...             51.29 cents  131669275
16        1950      151,325,798  ...             60.44 cents  151325798
17        1960      179,323,175  ...             71.34 cents  179323175
18        1970      203,302,031  ...                   $1.22  203302031
19        1980      226,542,199  ...                   $4.76  226542199
20        1990      248,718,301  ...                  $10.02  248718301
21        2000      281,421,906  ...                  $15.99  281421906
22       2010*      308,745,538  ...                  $42.11  308745538

[23 rows x 5 columns]

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              23 non-null     object
 1   Total Population         23 non-null     object
 2   Census Cost              23 non-null     object
 3   Average Cost Per Person  23 non-null     object
 4   total pop                23 non-null     int64
dtypes: int64(1), object(4)
memory usage: 1.0+ KB

In [69]:
df.describe(include="all")

       Census Year Total Population  ... Average Cost Per Person     total pop
count           23               23  ...                      23  2.300000e+01
unique          23               23  ...                      23           NaN
top           1840      308,745,538  ...                  $42.11           NaN
freq             1                1  ...                       1           NaN
mean           NaN              NaN  ...                     NaN  1.039211e+08
std            NaN              NaN  ...                     NaN  9.622629e+07
min            NaN              NaN  ...                     NaN  3.929214e+06
25%            NaN              NaN  ...                     NaN  2.013067e+07
50%            NaN              NaN  ...                     NaN  7.630339e+07
75%            NaN              NaN  ...                     NaN  1.653245e+08
max            NaN              NaN  ...                     NaN  3.087455e+08

[11 rows x 5 columns]